
export class NQXLC_Dialog {
    public static MainDialog: string[][] = [
        [
            "你叫路小染，19岁，这一届的大一新生，对于即将迎来的大学新生活————",
            "你既充满了期待，又莫名有些不安。",
            "你看了一下身旁放着行李的空座位，突然觉得有些伤感，不由得想起了高中的那些死党们。",
            "不知他们正在做什么，是否也坐上了去往各自大学的校车，忐忑或期待着未来的新生活。",
            // "",//手机对话
            "你 真不是做梦吧......",
            "你 简直太好了，嘻嘻!",
            "虽然刚刚嘴上说着不在意，其实心里还是高兴又激动的，没想到能与高中的死党再聚,",
            "简直是天大的幸运!然而正当你喜滋滋地依着车窗窃笑之时，突然————",//车子抖动
            "一阵剧烈的摇晃后，车子缓缓停靠在了路边。",
            "伴着大家渐渐涌起的骚动，司机从驾驶位走了下来，一脸的无奈。",
            "司机 抱歉了各位家长同学们，车子出故障抛锚了你们可能要下车多走一段路了。",
            "闻此，车厢内顿时响起一片议论之声，隐约夹杂着不满的质疑与抱怨。",//对话选择
            "抱怨的呼声越来越高，在座的一些人纷纷提出了要让学校派其他车辆来接的要求。",
            "司机 再派其他车来倒也可以，不过今天新生到校，校车都在接学生的路上没有空车。",
            "司机 如果你们不介意等的话倒是可以等，不过其实校门离这里很近，穿过商业街就是。",
            "司机 等其他车送完学生回来接，或者自己多走几步路，你们自己选吧",
            "司机 不管怎样这车上是不能呆了。大家拿好行李有序下车吧，想等的在路边等着。",
            "司机 不过，我可不保证你们要等多久。",
            "司机的言外之意是相当明确了......",
            "大家虽然有诸多不满，但是第一天报到不想惹事，也就都乖乖下车了。",
            "无奈，你也只得跟在其他人的身后，拖着沉重的行李走下了校车。",
        ]
    ]
}

//场景1 手机对话
export const Main1Phone: string[] = [
    "在么？",
    "：）",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
]


