import { _decorator, Component, Node } from 'cc';
const { ccclass, property } = _decorator;

export enum 头发 {
    棕色,
    黑色,
    金色,
    橙色,
    长发,
    短发,
    秃头,
}

export enum 眼睛 {
    棕色,
    绿色,
    蓝色,
}

export enum 配饰 {
    眼镜,
    耳环,
    发饰,
    帽子,
}

export enum 其他 {
    胡子,
    胡须,
    黑色皮肤,
    白色皮肤,
}

@ccclass('CCWSS_Constant')
export class CCWSS_Constant extends Component {
    static MeRound: boolean;//自己的回合
    static MeSelectIndex: number = -1;//己方选择的人物编号
    static AISelectIndex: number = -1;//AI选择的人物编号
    static MeCardNum: number = 24;//己方剩余卡牌
    static AICardNum: number = 24;//AI剩余卡牌
    static Question: number[] = [];
    static PeopleNames = ["罗伊", "艾玛", "杰瑞", "丽莎", "雅格", "伊森", "麦迪森", "安东尼",
        "索菲亚", "大卫", "阿比盖尔", "亚历山大", "安娜", "本杰明", "玛丽亚", "斯科特",
        "坎贝尔", "蒂芬妮", "马丁", "瑞秋", "理查德", "劳拉", "查尔斯", "琳达"];

    static TeZhengDesc = [
        ["是棕色头发吗？", "是黑色头发吗？", "是金色头发吗？", "是橙色头发吗？", "是长头发吗？", "是短头发吗？", "是秃头吗？"],
        ["是棕色眼睛吗？", "是绿色眼睛吗？", "是蓝色眼睛吗？"],
        ["有戴眼镜吗？", "有戴耳环吗？", "有戴任何发饰吗？", "有戴帽子吗？"],
        ["有胡子吗？", "有胡须吗？", "是黑色皮肤吗？", "是白色皮肤吗？"]
    ]

    static HelpDesc = [
        ["00他(她)不是棕色头发", "01他(她)不是黑色头发", "02他(她)不是金色头发", "03他(她)不是橙色头发", "04他(她)不是长头发", "05他(她)不是短头发", "06他(她)不是秃头"],
        ["10他(她)不是棕色眼睛", "11他(她)不是绿色眼睛", "12他(她)不是蓝色眼睛"],
        ["20他(她)没有戴眼镜", "21他(她)没有戴耳环", "22他(她)没有戴任何发饰", "23他(她)没有戴帽子"],
        ["30他(她)没有胡子", "31他(她)没有胡须", "32他(她)不是黑色皮肤", "33他(她)不是白色皮肤"]
    ]

    static SpliceHelpDesc = []

    //初始化数据
    static InitData() {
        CCWSS_Constant.MeSelectIndex = -1;
        CCWSS_Constant.MeCardNum = CCWSS_Constant.AICardNum = 24;
        CCWSS_Constant.AIQuestion = [
            [[0, 0], [0, 1], [0, 2], [0, 3]],
            [[0, 4], [0, 5], [0, 6]],
            [[1, 0], [1, 1], [1, 2]],
            [[2, 0]],
            [[2, 1]],
            [[2, 2]],
            [[2, 3]],
            [[3, 0]],
            [[3, 1]],
            [[3, 2], [3, 3]],
        ]
        CCWSS_Constant.SpliceHelpDesc = [];
    }

    //AI问题集锦
    static AIQuestion = [
        [[0, 0], [0, 1], [0, 2], [0, 3]],
        [[0, 4], [0, 5], [0, 6]],
        [[1, 0], [1, 1], [1, 2]],
        [[2, 0]],
        [[2, 1]],
        [[2, 2]],
        [[2, 3]],
        [[3, 0]],
        [[3, 1]],
        [[3, 2], [3, 3]],
    ]

    static PeopleTeZheng = [
        //      头发              眼睛         配饰           其他
        //棕 黑 金 橙 长 短 秃   棕 绿 蓝 眼镜耳环发饰帽子 胡子胡须黑皮白皮
        [[0, 1, 0, 0, 0, 1, 0], [1, 0, 0], [1, 0, 0, 0], [0, 0, 1, 0]],//人物1
        [[0, 0, 0, 1, 1, 0, 0], [0, 1, 0], [0, 0, 0, 0], [0, 0, 0, 1]],//人物2
        [[0, 1, 0, 0, 0, 1, 0], [1, 0, 0], [0, 0, 0, 1], [0, 0, 1, 0]],//人物3
        [[0, 0, 1, 0, 0, 1, 0], [0, 0, 1], [0, 0, 1, 0], [0, 0, 0, 1]],//人物4
        [[1, 0, 0, 0, 0, 1, 0], [1, 0, 0], [0, 0, 0, 0], [0, 0, 1, 0]],//人物5
        [[0, 0, 1, 0, 0, 1, 0], [0, 0, 1], [0, 0, 0, 1], [0, 0, 0, 1]],//人物6
        [[1, 0, 0, 0, 1, 0, 0], [0, 1, 0], [0, 0, 0, 0], [0, 0, 0, 1]],//人物7
        [[0, 0, 1, 0, 0, 1, 0], [1, 0, 0], [0, 0, 0, 0], [0, 0, 0, 1]],//人物8
        [[1, 0, 0, 0, 1, 0, 0], [0, 0, 1], [0, 1, 1, 0], [0, 0, 0, 1]],//人物9
        [[0, 0, 0, 0, 0, 0, 1], [0, 1, 0], [0, 0, 0, 0], [1, 1, 0, 1]],//人物10
        [[0, 0, 0, 1, 1, 0, 0], [1, 0, 0], [1, 0, 1, 0], [0, 0, 0, 1]],//人物11
        [[1, 0, 0, 0, 0, 1, 0], [0, 0, 1], [0, 0, 0, 1], [1, 1, 0, 1]],//人物12
        [[0, 1, 0, 0, 1, 0, 0], [0, 1, 0], [0, 1, 0, 0], [0, 0, 1, 0]],//人物13
        [[0, 0, 0, 1, 0, 1, 0], [0, 1, 0], [0, 0, 0, 0], [0, 0, 0, 1]],//人物14
        [[0, 0, 1, 0, 1, 0, 0], [0, 0, 1], [1, 0, 1, 0], [0, 0, 0, 1]],//人物15
        [[0, 1, 0, 0, 0, 1, 0], [1, 0, 0], [0, 0, 0, 0], [0, 1, 1, 0]],//人物16
        [[0, 0, 0, 0, 0, 0, 1], [1, 0, 0], [1, 1, 0, 0], [0, 0, 0, 1]],//人物17
        [[0, 1, 0, 0, 0, 1, 0], [1, 0, 0], [0, 0, 1, 0], [0, 0, 0, 1]],//人物18
        [[0, 0, 1, 0, 0, 1, 0], [0, 0, 1], [0, 0, 0, 0], [1, 1, 0, 1]],//人物19
        [[1, 0, 0, 0, 1, 0, 0], [0, 1, 0], [0, 0, 0, 1], [0, 0, 1, 0]],//人物20
        [[0, 1, 0, 0, 0, 1, 0], [0, 1, 0], [0, 0, 0, 0], [1, 0, 0, 1]],//人物21
        [[0, 0, 0, 1, 0, 1, 0], [0, 1, 0], [0, 1, 1, 0], [0, 0, 0, 1]],//人物22
        [[0, 0, 0, 0, 0, 0, 1], [0, 0, 1], [0, 0, 0, 1], [0, 1, 0, 1]],//人物23
        [[0, 1, 0, 0, 1, 0, 0], [0, 0, 1], [1, 0, 1, 0], [0, 0, 0, 1]],//人物24
    ]

}


