export enum CDXX_GROUP {
    DEFAULT = 1 << 0,
    CDXX_Player = 1 << 13,
    CDXX_PICKAXE = 1 << 15,
}

export enum CDXX_PICKAXE {
    鎏金执法者,
    木纹老兵,
    战垒撕咬者,
    绿影死神,
    黄芒突袭者,
    荒土战魂,
    幻彩游骑兵,
    锈纹拓荒者,
    迷彩幽灵,
    猩红复仇者,
    蓝火冲锋,
    紫电狂魔,
    金芒战矛,
    红缨怒号,
    圣金猎隼,
    丛林魅影,
    冰蓝海啸,
    猩红猎手,
    赤炼火炮,
    幻晶毒牙,
    星陨狂徒,

    // 铁镐,
    // 金镐,
    // 钻石镐,
    // 合金镐,
    // 红石镐,
    // 青金石镐,
    // 石英镐,
    // 莹石镐,
    // 紫水晶镐,
    // 黑曜石镐,
    // 红曜石镐,
    // 蓝曜石镐,
    // 红蓝镐,
    // 只因岩镐,
    // 创游土镐,
    // 创游草镐,
    // 水立方镐,
    // 火焰之镐,
    // 创游金镐,
}

export enum CDXX_PROP {
    紫水晶,
    红曜石碎片,
    蓝曜石碎片,
    只因岩碎片,
    土核心,
    草核心,
    水立方,
    火立方,
    金立方,
    使用增益,
    奖杯,
    金币,
    无,
}


export const CDXX_ScoreName: string[] = ["追梦人", "月下影", "浅秋", "风之痕", "青山如故", "独醉", "寒江雪", "云水谣", "流光溢彩", "落花飞絮", "镜中花", "浮生半梦", "山高水远", "长安忆", "灯火阑珊", "风月无边", "烟雨江南", "人间清欢", "桃源梦", "孤城", "夜雨潇潇", "水墨丹青", "锦瑟", "疏影横斜", "归舟晚风", "踏雪", "醉卧星河", "暮霭沉香", "竹影", "岁月静好", "花间辞", "南山清风", "月下独酌", "霓裳", "红尘梦", "琉璃", "清秋", "陌上烟雨", "流年", "星辰大海", "岁月", "千山暮雪", "青衣", "若水", "半夏", "浅笑", "梦里繁华", "碧海潮生", "听风", "紫陌", "飞花", "溪水", "光影", "晚霞", "流星", "故人", "落叶", "踏梦", "雪舞倾城", "星月", "烟火", "风华", "醉染", "山水", "清风", "梦回长安", "云深处", "霜雪千年", "风轻云淡", "碧水蓝天", "沧海明月", "听海", "一叶知秋", "素衣青衫", "红尘旧事", "白露未晞", "繁花落尽", "千纸鹤", "朝露未晞", "秋风送爽", "江南烟雨", "琴音悠远", "南山雪落", "溪畔听风", "夜色微凉", "寒梅傲雪", "春风十里", "山涧清泉", "云卷云舒", "落霞孤鹜", "世外桃源", "梦醒", "星夜微光", "风过故里", "暮色浅歌", "岁月长河", "南风知意", "烟霞旧梦", "流云归舟", "星辰", "孤星", "清风醉影", "长安回眸", "雪中旅人", "花间酒", "云水幽梦", "夜未央", "江湖行者", "秋水长", "疏影寒梅", "故梦无痕", "镜花若水", "青梅忆", "紫陌长歌", "碧落云天", "一世清欢", "春风踏雪", "梦断江南", "南山听风", "灯火阑", "红尘归处", "烟雨楼中", "一叶秋", "晚风几许", "星河漫漫", "江南逝影", "月下孤笛", "繁花寂", "霜寒夜月", "竹影清幽", "雪中孤灯", "三千山水", "时光流转", "浮生一梦", "山涧冷月", "晓风残", "孤舟夜归", "云卷长空", "秋夜细雨", "月色微凉", "落花听禅", "晨曦淡然", "雪落天涯", "柳絮飞花", "夜色浅酌", "清风南渡", "碧水长青", "山海人间", "霜满清秋", "长亭梦醒", "江月如昔", "灯火依旧", "夜色微澜", "云深不知处", "水墨流云", "梦醒流年", "天边孤鸿", "远山冷黛", "流水人家", "寒风萧", "繁星漫天", "山川岁月", "月下笛影", "夜深微凉", "孤灯不灭", "烟波渺渺", "明月如画", "一抹夕阳", "梦中谁忆", "春风缱绻", "秋风过客", "流年逝影", "雨落南山", "镜中烟花", "青衫故人", "雪夜歌", "南风十里", "朝阳初升", "夜幕微光", "天涯旧梦", "一世清浅", "山水万里", "风雪归来", "云海听涛", "浮生如雪", "千山共渡", "花间清语", "碧空霁月", "雨中山影", "孤舟旧梦", "寒夜长歌", "柳下清风", "霜晨孤影", "暮光浮生"]
export const CDXX_Score: number[] = [59456781883, 58991904333, 58572835176, 58565413290, 58327919760, 58121651568, 56627311596, 55999580867, 53116382859, 52940413252, 52521041370, 49993841176, 49990176175, 49774113571, 48924647889, 48774327073, 48504411129, 48222161410, 47927375045, 47903134437, 46932557816, 46926999632, 46654540121, 45492212072, 44456080172, 42814160714, 42761359300, 41795999664, 41394380917, 41101759453, 40587091881, 40544777057, 40538305606, 40393465045, 39421964725, 39267612458, 38943082636, 38505158324, 38476733475, 37197416670, 36922420069, 36354273321, 35756661523, 34684327266, 33537308857, 33318109909, 32851552999, 32313318036, 32232806095, 31854783162, 31499338260, 31407686643, 31024879943, 29251520790, 28543045677, 27365015320, 27111408646, 26219417945, 25643684132, 25255239026, 25217705512, 25093687918, 24737255782, 24450049410, 24345386822, 23788530782, 23527259122, 22323426439, 22053099807, 21232417438, 21039831851, 19123044295, 18026423405, 17271354861, 17077938301, 17028901673, 16447821572, 16431859706, 16201191511, 15214139725, 14781310633, 14008326881, 13611230116, 13058767830, 12971298913, 12909398859, 12801894875, 10782946540, 10333684482, 9618571964, 8807301458, 8154761836, 8073955128, 8018067631, 7668290990, 7637931279, 6883128522, 5923050723, 5834721185, 5216776427];

// export const CDXX_ScoreName: string[] = ["追梦人", "月下影", "浅秋", "风之痕", "青山如故", "独醉", "寒江雪", "云水谣", "流光溢彩", "落花飞絮", "镜中花", "浮生半梦", "山高水远", "长安忆", "灯火阑珊", "风月无边", "烟雨江南", "人间清欢", "桃源梦", "孤城", "夜雨潇潇", "水墨丹青", "锦瑟", "疏影横斜", "归舟晚风", "踏雪", "醉卧星河", "暮霭沉香", "竹影", "岁月静好", "花间辞", "南山清风", "月下独酌", "霓裳", "红尘梦", "琉璃", "清秋", "陌上烟雨", "流年", "星辰大海", "岁月", "千山暮雪", "青衣", "若水", "半夏", "浅笑", "梦里繁华", "碧海潮生", "听风", "紫陌", "飞花", "溪水", "光影", "晚霞", "流星", "故人", "落叶", "踏梦", "雪舞倾城", "星月", "烟火", "风华", "醉染", "山水", "清风", "梦回长安", "云深处", "霜雪千年", "风轻云淡", "碧水蓝天", "沧海明月", "听海", "一叶知秋", "素衣青衫", "红尘旧事", "白露未晞", "繁花落尽", "千纸鹤", "朝露未晞", "秋风送爽", "江南烟雨", "琴音悠远", "南山雪落", "溪畔听风", "夜色微凉", "寒梅傲雪", "春风十里", "山涧清泉", "云卷云舒", "落霞孤鹜", "世外桃源", "梦醒", "星夜微光", "风过故里", "暮色浅歌", "岁月长河", "南风知意", "烟霞旧梦", "流云归舟", "星辰", "孤星", "清风醉影", "长安回眸", "雪中旅人", "花间酒", "云水幽梦", "夜未央", "江湖行者", "秋水长", "疏影寒梅", "故梦无痕", "镜花若水", "青梅忆", "紫陌长歌", "碧落云天", "一世清欢", "春风踏雪", "梦断江南", "南山听风", "灯火阑", "红尘归处", "烟雨楼中", "一叶秋", "晚风几许", "星河漫漫", "江南逝影", "月下孤笛", "繁花寂", "霜寒夜月", "竹影清幽", "雪中孤灯", "三千山水", "时光流转", "浮生一梦", "山涧冷月", "晓风残", "孤舟夜归", "云卷长空", "秋夜细雨", "月色微凉", "落花听禅", "晨曦淡然", "雪落天涯", "柳絮飞花", "夜色浅酌", "清风南渡", "碧水长青", "山海人间", "霜满清秋", "长亭梦醒", "江月如昔", "灯火依旧", "夜色微澜", "云深不知处", "水墨流云", "梦醒流年", "天边孤鸿", "远山冷黛", "流水人家", "寒风萧", "繁星漫天", "山川岁月", "月下笛影", "夜深微凉", "孤灯不灭", "烟波渺渺", "明月如画", "一抹夕阳", "梦中谁忆", "春风缱绻", "秋风过客", "流年逝影", "雨落南山", "镜中烟花", "青衫故人", "雪夜歌", "南风十里", "朝阳初升", "夜幕微光", "天涯旧梦", "一世清浅", "山水万里", "风雪归来", "云海听涛", "浮生如雪", "千山共渡", "花间清语", "碧空霁月", "雨中山影", "孤舟旧梦", "寒夜长歌", "柳下清风", "霜晨孤影", "暮光浮生"]
// export const CDXX_Score: number[] = [59456781883, 58991904333, 58572835176, 58565413290, 58327919760, 58121651568, 56627311596, 55999580867, 53116382859, 52940413252, 52521041370, 49993841176, 49990176175, 49774113571, 48924647889, 48774327073, 48504411129, 48222161410, 47927375045, 47903134437, 46932557816, 46926999632, 46654540121, 45492212072, 44456080172, 42814160714, 42761359300, 41795999664, 41394380917, 41101759453, 40587091881, 40544777057, 40538305606, 40393465045, 39421964725, 39267612458, 38943082636, 38505158324, 38476733475, 37197416670, 36922420069, 36354273321, 35756661523, 34684327266, 33537308857, 33318109909, 32851552999, 32313318036, 32232806095, 31854783162, 31499338260, 31407686643, 31024879943, 29251520790, 28543045677, 27365015320, 27111408646, 26219417945, 25643684132, 25255239026, 25217705512, 25093687918, 24737255782, 24450049410, 24345386822, 23788530782, 23527259122, 22323426439, 22053099807, 21232417438, 21039831851, 19123044295, 18026423405, 17271354861, 17077938301, 17028901673, 16447821572, 16431859706, 16201191511, 15214139725, 14781310633, 14008326881, 13611230116, 13058767830, 12971298913, 12909398859, 12801894875, 10782946540, 10333684482, 9618571964, 8807301458, 8154761836, 8073955128, 8018067631, 7668290990, 7637931279, 6883128522, 5923050723, 5834721185, 5216776427];


export class CDXX_ELIXIR {
    Name: string;
    Count: number;
    Amp_JY: number;//经验
    Amp_HP: number;//血量
    Amp_HARM: number;//伤害
    Amp_ZL: number;//战力

    constructor(name: string, count: number, Amp_JY: number, Amp_HP: number, Amp_HARM: number, Amp_ZL: number) {
        this.Name = name;
        this.Count = count;
        this.Amp_JY = Amp_JY;
        this.Amp_HP = Amp_HP;
        this.Amp_HARM = Amp_HARM;
        this.Amp_ZL = Amp_ZL;
    }
}

export const CDXX_ELIXIR_CONFIG: Map<string, CDXX_ELIXIR> = new Map([
    ["凡丹一阶", new CDXX_ELIXIR("凡丹一阶", 1, 1, 1, 1, 2)],
    ["凡丹二阶", new CDXX_ELIXIR("凡丹二阶", 1, 3, 3, 2, 5)],
    ["凡丹三阶", new CDXX_ELIXIR("凡丹三阶", 1, 7, 7, 3, 10)],
    ["凡丹四阶", new CDXX_ELIXIR("凡丹四阶", 1, 15, 15, 4, 19)],
    ["凡丹五阶", new CDXX_ELIXIR("凡丹五阶", 1, 30, 30, 5, 35)],

    ["灵丹", new CDXX_ELIXIR("灵丹", 1, 100, 100, 10, 111)],
    ["灵丹完美", new CDXX_ELIXIR("灵丹完美", 1, 3000, 3000, 50, 353)],

    ["仙丹", new CDXX_ELIXIR("仙丹", 1, 10000, 10000, 99, 1099)],
    ["仙丹完美", new CDXX_ELIXIR("仙丹完美", 1, 300000, 300000, 499, 3555)],

    ["圣丹", new CDXX_ELIXIR("圣丹", 1, 1000000, 1000000, 999, 19999)],
    ["圣丹完美", new CDXX_ELIXIR("圣丹完美", 1, 30000000, 30000000, 4999, 35555)],

    ["帝丹", new CDXX_ELIXIR("帝丹", 1, 100000000, 100000000, 9999, 199999)],
    ["帝丹完美", new CDXX_ELIXIR("帝丹完美", 1, 3000000000, 3000000000, 49999, 355555)],

    ["神丹", new CDXX_ELIXIR("神丹", 1, 10000000000, 10000000000, 99999, 1999999)],
    ["神丹完美", new CDXX_ELIXIR("神丹完美", 1, 300000000000, 300000000000, 499999, 3555555)],
])

export class CDXX_ENEMY_CLASS {
    HP: number;
    Harm: number;
    constructor(hp: number, harm: number) {
        this.HP = hp;
        this.Harm = harm;
    }
}

export const CDXX_ENEMY_CONFIG: Map<string, CDXX_ENEMY_CLASS> = new Map([
    ["初级妖兽", new CDXX_ENEMY_CLASS(10, 1)],
    ["中级妖兽", new CDXX_ENEMY_CLASS(30, 3)],
    ["高级妖兽", new CDXX_ENEMY_CLASS(70, 7)],
    ["巅峰妖兽", new CDXX_ENEMY_CLASS(150, 15)],
    ["圆满妖兽", new CDXX_ENEMY_CLASS(300, 30)],

    ["初级灵兽", new CDXX_ENEMY_CLASS(1000, 100)],
    ["中级灵兽", new CDXX_ENEMY_CLASS(3000, 300)],
    ["高级灵兽", new CDXX_ENEMY_CLASS(7000, 700)],
    ["巅峰灵兽", new CDXX_ENEMY_CLASS(15000, 1500)],
    ["圆满灵兽", new CDXX_ENEMY_CLASS(30000, 3000)],

    ["初级仙兽", new CDXX_ENEMY_CLASS(100000, 10000)],
    ["中级仙兽", new CDXX_ENEMY_CLASS(300000, 30000)],
    ["高级仙兽", new CDXX_ENEMY_CLASS(700000, 70000)],
    ["巅峰仙兽", new CDXX_ENEMY_CLASS(1500000, 150000)],
    ["圆满仙兽", new CDXX_ENEMY_CLASS(3000000, 300000)],

    ["初级圣兽", new CDXX_ENEMY_CLASS(10000000, 1000000)],
    ["中级圣兽", new CDXX_ENEMY_CLASS(30000000, 3000000)],
    ["高级圣兽", new CDXX_ENEMY_CLASS(70000000, 7000000)],
    ["巅峰圣兽", new CDXX_ENEMY_CLASS(150000000, 15000000)],
    ["圆满圣兽", new CDXX_ENEMY_CLASS(300000000, 30000000)],

    ["初级帝兽", new CDXX_ENEMY_CLASS(1000000000, 1000000)],
    ["中级帝兽", new CDXX_ENEMY_CLASS(3000000000, 3000000)],
    ["高级帝兽", new CDXX_ENEMY_CLASS(7000000000, 7000000)],
    ["巅峰帝兽", new CDXX_ENEMY_CLASS(15000000000, 15000000)],
    ["圆满帝兽", new CDXX_ENEMY_CLASS(30000000000, 30000000)],

    ["初级神兽", new CDXX_ENEMY_CLASS(100000000000, 10000000)],
    ["中级神兽", new CDXX_ENEMY_CLASS(300000000000, 30000000)],
    ["高级神兽", new CDXX_ENEMY_CLASS(700000000000, 70000000)],
    ["巅峰神兽", new CDXX_ENEMY_CLASS(1500000000000, 150000000)],
    ["圆满神兽", new CDXX_ENEMY_CLASS(3000000000000, 300000000)],
])

export const CDXX_INTRODUCE: Map<string, string> = new Map([
    ["鎏金执法者", "鎏金执法者--新手手枪"],
    ["冰蓝海啸", "冰蓝海啸"],
    ["猩红猎手", "猩红猎手"],
    ["赤炼火炮", "赤炼火炮"],
    ["幻晶毒牙", "幻晶毒牙"],
    ["星陨狂徒", "星陨狂徒"],
])

/**
 * 凡阶、灵阶、仙阶、圣阶、帝阶，神阶       初级，中级，高级，巅峰，圆满
 */

export enum CDXX_ENEMY {
    初级妖兽,
    中级妖兽,
    高级妖兽,
    巅峰妖兽,
    圆满妖兽,

    初级灵兽,
    中级灵兽,
    高级灵兽,
    巅峰灵兽,
    圆满灵兽,

    初级仙兽,
    中级仙兽,
    高级仙兽,
    巅峰仙兽,
    圆满仙兽,

    初级圣兽,
    中级圣兽,
    高级圣兽,
    巅峰圣兽,
    圆满圣兽,

    初级帝兽,
    中级帝兽,
    高级帝兽,
    巅峰帝兽,
    圆满帝兽,

    初级神兽,
    中级神兽,
    高级神兽,
    巅峰神兽,
    圆满神兽,
}

export enum CDXX_BG_TYPE {
    MAP,
    NAME,
}

export enum CDXX_BG {
    凡界_下层,
    凡界_上层,

    灵界_下层,
    灵界_上层,

    仙界_下层,
    仙界_上层,
}

export const CDXX_TJZL: Map<CDXX_BG, number> = new Map([
    [CDXX_BG.凡界_下层, 1],
    [CDXX_BG.凡界_上层, 100],
    [CDXX_BG.灵界_下层, 10000],
    [CDXX_BG.灵界_上层, 1000000],
    [CDXX_BG.仙界_下层, 100000000],
    [CDXX_BG.仙界_上层, 10000000000],
])

export enum CDXX_ELIXIR_NAME {
    凡丹一阶,
    凡丹二阶,
    凡丹三阶,
    凡丹四阶,
    凡丹五阶,

    灵丹,
    灵丹完美,

    仙丹,
    仙丹完美,

    圣丹,
    圣丹完美,

    帝丹,
    帝丹完美,

    神丹,
    神丹完美,
}

export enum CDXX_REALM {
    筑基初期 = 10,
    筑基中期 = 30,
    筑基后期 = 70,
    筑基巅峰 = 150,
    筑基圆满 = 300,

    金丹初期 = 1000,
    金丹中期 = 3000,
    金丹后期 = 7000,
    金丹巅峰 = 15000,
    金丹圆满 = 30000,

    元婴初期 = 100000,
    元婴中期 = 300000,
    元婴后期 = 700000,
    元婴巅峰 = 1500000,
    元婴圆满 = 3000000,

    化神初期 = 10000000,
    化神中期 = 30000000,
    化神后期 = 70000000,
    化神巅峰 = 150000000,
    化神圆满 = 300000000,

    炼虚初期 = 1000000000,
    炼虚中期 = 3000000000,
    炼虚后期 = 7000000000,
    炼虚巅峰 = 15000000000,
    炼虚圆满 = 30000000000,

    合体初期 = 100000000000,
    合体中期 = 300000000000,
    合体后期 = 700000000000,
    合体巅峰 = 1500000000000,
    合体圆满 = 3000000000000,

    大乘初期 = 10000000000000,
    大乘中期 = 30000000000000,
    大乘后期 = 70000000000000,
    大乘巅峰 = 150000000000000,
    大乘圆满 = 300000000000000,

    飞升初期 = 1000000000000000,
    飞升中期 = 3000000000000000,
    飞升后期 = 7000000000000000,
    飞升巅峰 = 15000000000000000,
    飞升圆满,
}

export const CDXX_NEXT_REALM: Map<CDXX_REALM, CDXX_REALM> = new Map([
    [CDXX_REALM.筑基初期, CDXX_REALM.筑基中期],
    [CDXX_REALM.筑基中期, CDXX_REALM.筑基后期],
    [CDXX_REALM.筑基后期, CDXX_REALM.筑基巅峰],
    [CDXX_REALM.筑基巅峰, CDXX_REALM.筑基圆满],
    [CDXX_REALM.筑基圆满, CDXX_REALM.金丹初期],

    [CDXX_REALM.金丹初期, CDXX_REALM.金丹中期],
    [CDXX_REALM.金丹中期, CDXX_REALM.金丹后期],
    [CDXX_REALM.金丹后期, CDXX_REALM.金丹巅峰],
    [CDXX_REALM.金丹巅峰, CDXX_REALM.金丹圆满],
    [CDXX_REALM.金丹圆满, CDXX_REALM.元婴初期],

    [CDXX_REALM.元婴初期, CDXX_REALM.元婴中期],
    [CDXX_REALM.元婴中期, CDXX_REALM.元婴后期],
    [CDXX_REALM.元婴后期, CDXX_REALM.元婴巅峰],
    [CDXX_REALM.元婴巅峰, CDXX_REALM.元婴圆满],
    [CDXX_REALM.元婴圆满, CDXX_REALM.化神初期],

    [CDXX_REALM.化神初期, CDXX_REALM.化神中期],
    [CDXX_REALM.化神中期, CDXX_REALM.化神后期],
    [CDXX_REALM.化神后期, CDXX_REALM.化神巅峰],
    [CDXX_REALM.化神巅峰, CDXX_REALM.化神圆满],
    [CDXX_REALM.化神圆满, CDXX_REALM.炼虚初期],

    [CDXX_REALM.炼虚初期, CDXX_REALM.炼虚中期],
    [CDXX_REALM.炼虚中期, CDXX_REALM.炼虚后期],
    [CDXX_REALM.炼虚后期, CDXX_REALM.炼虚巅峰],
    [CDXX_REALM.炼虚巅峰, CDXX_REALM.炼虚圆满],
    [CDXX_REALM.炼虚圆满, CDXX_REALM.合体初期],

    [CDXX_REALM.合体初期, CDXX_REALM.合体中期],
    [CDXX_REALM.合体中期, CDXX_REALM.合体后期],
    [CDXX_REALM.合体后期, CDXX_REALM.合体巅峰],
    [CDXX_REALM.合体巅峰, CDXX_REALM.合体圆满],
    [CDXX_REALM.合体圆满, CDXX_REALM.大乘初期],

    [CDXX_REALM.大乘初期, CDXX_REALM.大乘中期],
    [CDXX_REALM.大乘中期, CDXX_REALM.大乘后期],
    [CDXX_REALM.大乘后期, CDXX_REALM.大乘巅峰],
    [CDXX_REALM.大乘巅峰, CDXX_REALM.大乘圆满],
    [CDXX_REALM.大乘圆满, CDXX_REALM.飞升初期],

    [CDXX_REALM.飞升初期, CDXX_REALM.飞升中期],
    [CDXX_REALM.飞升中期, CDXX_REALM.飞升后期],
    [CDXX_REALM.飞升后期, CDXX_REALM.飞升巅峰],
    [CDXX_REALM.飞升巅峰, CDXX_REALM.飞升圆满],
])

export enum CDXX_STATE {
    血量,
    攻击,
    战力,
}

