export enum WBSRL_ROOM {
    浴室,
    储物间,
    厨房,
    客厅1,
    客厅2,
}

export const WBSRL_Monologues_Window: string[][][] = [
    //day 1
    [
        [], [], []
    ],
    //day 2
    [
        [
            "远处是邻居家。邻居现在正在拜访你。",
            "窗户上的灯亮着，家人似乎在等他离开你回家吃晚饭。",

        ],
        [
            "你可以看到几个青少年在窗外的田野里消磨时间。",
            "他们坐在那里兴奋地聊天，没有注意到你。",
        ],
        [
            "外面一片死寂。",
            "没有人在那里。",
            "即使是酒鬼，出于某种未知的原因，也决定不出现在街上。",
            "他们害怕别人吗?",
        ]
    ],
    //day 3
    [
        [
            "窗外站着一位邻居和他的女儿。",
            "他们一起快乐地玩耍，忘记了正在发生的恐怖。",
            "就一会儿。",
            "看着这一切，你会想起你的童年，并给你一种温暖的怀旧感。",

        ],
        [
            "地上有青少年的尸体。",
            "有人杀了他们",
            "这似乎是最近的事，因为血液还没有干涸。",
            "这张照片让你起鸡皮疙瘩，让你感到有点不安。",
        ],
        [
            "路上站着一个脸色苍白的人。",
            "他的皮肤上有奇怪的褶皱。",
            "这皮肤对他来说似乎太大了。",
            "从这里你看不到他的眼睛，但你可以感觉到他用目光在折磨你。",
            "你感到恐惧，并向上帝祈祷，让这个令人毛骨悚然的访客避开这所房子。",
        ]
    ],
    //day 4
    [
        [
            "一小群联邦紧急事务管理局的工作人员站在邻居家外面。",
            "我想知道他们在说什么?",
            "也许他们正在采集土壤样本?",
            "还是他们在找一个地方建立基地?",
            "想到有人试图理解这场噩梦，你会感觉好一点。",
        ],
        [
            "青少年的尸体在地上被烧死。",
            "他们似乎整天都躺在这里。",
            "两名急救人员站在尸体旁边，写下了一些东西。",
            "有人能移走尸体，这很好。",
            "想象一下，如果不把腐烂的尸体从街上移走，会出现什么样的传染病，这很可怕。",

        ],
        [
            "窗外有一群武装士兵。",
            "显然，个他们是从城市派来的一个小单位，为人门提供安全保障。",
            "你只能听到关于一个赤裸躯干的苍白男人的零碎短语。",
            "也许他们想追踪那个令人毛骨悚然的陌生人 ? ",
            "你感到宽慰的是，有人准备在街上对付一个危险的客人。",
        ]
    ],
    //day 5
    [
        [], [], []
    ],
    //day 6
    [
        [], [], []
    ],
]

