
import { _decorator, Component, Enum, Node, v3 } from 'cc';
const { ccclass, property } = _decorator;

@ccclass('MTRNX_Constant')
export class MTRNX_Constant extends Component {

    //最大科技等级数
    static MaxScience = 5;
    //最大分数发放奖励秒数
    static MaxScoreReward = 120;

    //基地血量
    static MaxRedHP = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20];
    static MaxBlueHP = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20];

    //放置费用
    static JKTypePointCost = [0, 35, 100, 150, 320, 0, 0, 600, 900, 50, 125, 250, 200, 280, 300, 500, 750, 50, 100, 240, 400, 450, 450, 220, 400];
    // static JKTypePointCost = [0, 35, 50, 100, 125, 150, 250, 320, 600, 900];
    static MTTypePointCost = [0, 35, 50, 100, 125, 500, 150, 400, 600, 800, 400, 400, 300, 1000, 200, 400, 600, 250, 100, 750, 400, 600];
    //冷却时间
    static JKTypeColdDownCost = [2, 2, 3, 3, 5, 5, 7, 10, 10, 8, 8, 8, 8, 6, 12, 14, 10, 10, 8, 12, 12, 10, 8, 12];
    //科技升级所需点数
    static ScienceCost = [0, 200, 400, 600, 800, 1000];
    //关卡解锁所需要的钥匙数
    static LvUnlockKeyCost = [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1];
    //监控精英怪
    static JKBOSS: number[] = [7, 8, 13, 14, 15, 16, 19, 20, 21, 22, 23, 24];



    //杀戮模式姓名
    static PlayerName: string[] = ["监控人", "电视人", "人形哥", "音响人", "中型监控人", "无双战神", "泰坦电脑人战损版", "三体泰坦",
        "地狱泰坦投影人", "泰坦电钻人", "泰坦投影人", "红莲泰坦", "泰坦火箭人", "紫焰三体泰坦", "究极泰坦电视人", "究极泰坦监控人", "究极泰坦音响人",
        "炎刃泰坦音响人", "中型音响人", "泰坦音响人", "无双战神2", "仿生马桶博士", "撒旦螳螂刀马桶人", "地狱闪电马桶人", "异次元泰坦电视人", "地狱变异马桶人",
        "异次元泰坦音响人", "黄金泰坦时钟人", "龙焰泰坦监控人", "地狱武士刀马桶人", "马桶人之王", "地狱泰坦电视人", "光明泰坦监控", "泰坦转轮人", "万丈圣光泰坦"
    ];
    static ShopiingUnit: number[] = [0, 2, 4];
    //杀戮模式商店价格]
    static PlayerPrice: number[] = [0, 600, 1000, 2000, 4000, 8000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12000, 18000, 22000, 0, 0, 0, 0, 0, 0, 0, 0, 0
        , 0, 0, 0, 0, 0
    ];
    static PlayerUpPrice: number[] = [100, 200, 400, 800, 1200, 2000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4000, 7000, 10000, 0, 0, 0, 0, 0, 0, 0, 0, 0
        , 0, 0, 0, 0, 0
    ];//基础升级费用
    //杀戮模式人物基础属性
    static PlayerAttack: number[] = [20, 30, 40, 50, 60, 80, 100, 120, 140, 160, 170, 200, 220, 240, 260, 280, 290, 320, 100, 120, 140, 340, 360,
        300, 320, 330, 350, 360, 380, 400, 420, 430, 450, 480, 500
    ];
    static PlayerHp: number[] = [100, 200, 300, 400, 500, 700, 1000, 1200, 1400, 1800, 2000, 2500, 2800, 3300, 3700, 4000, 4200, 4500, 900,
        1100, 1250, 5000, 6000, 5000, 6000, 6500, 7000, 7500, 8000, 9000, 9700, 10000, 11000, 12000, 13000];
    static PlayerMp: number[] = [100, 120, 200, 250, 300, 400, 700, 900, 1000, 1200, 1300, 1600, 1800, 2300, 2500, 2600, 2800, 3300, 500, 600, 750,
        3500, 4000, 2800, 3000, 3300, 3500, 4000, 4500, 5000, 5500, 5800, 6200, 6500, 7000
    ];
    static PlayerHprecover: number[] = [2, 4, 5, 7, 8, 10, 12, 14, 15, 18, 19, 22, 24, 26, 28, 30, 32, 35, 8, 10, 12, 38, 40, 36, 38, 40, 42, 44, 46, 48
        , 50, 53, 55, 57, 60
    ];
    static PlayerMprecover: number[] = [1, 1, 2, 2, 3, 4, 6, 8, 10, 12, 13, 15, 17, 20, 22, 24, 26, 28, 6, 8, 10, 30, 32, 30, 30, 32, 34, 36, 38, 40, 42
        , 44, 46, 48, 50
    ];
    static PlayerSkillCD: number[][] =
        [[0, 3, 8, 9, 10, 9], [0, 3, 9, 10, 10, 9], [0, 3, 6, 10, 10, 9], [0, 3, 8, 9, 10, 9], [0, 3, 8, 9, 10, 9], [0, 3, 8, 9, 10, 9],
        [0, 3, 8, 9, 10, 9], [0, 3, 5, 5, 10, 9], [0, 3, 7, 7, 10, 9], [0, 3, 6, 10, 6, 9], [0, 3, 6, 10, 6, 9], [0, 3, 4, 6, 6, 9],
        [0, 3, 5, 6, 8, 9], [0, 3, 6, 6, 6, 9], [0, 3, 6, 6, 6, 9], [0, 3, 6, 6, 6, 9], [0, 3, 5, 7, 11, 9], [0, 3, 5, 7, 11, 9],
        [0, 3, 5, 7, 11, 9], [0, 3, 5, 7, 11, 9], [0, 3, 5, 7, 11, 9], [0, 3, 6, 7, 6, 9], [0, 3, 6, 7, 6, 9], [0, 3, 6, 7, 6, 9],
        [0, 3, 6, 7, 6, 9], [0, 3, 6, 7, 6, 9], [0, 3, 8, 6, 6, 9], [0, 3, 8, 6, 6, 9], [0, 3, 8, 6, 6, 9], [0, 3, 8, 6, 6, 9],
        [0, 3, 8, 6, 6, 9], [0, 3, 8, 6, 6, 9], [0, 3, 8, 6, 6, 9], [0, 3, 8, 6, 6, 9], [0, 3, 8, 6, 6, 9],];
    static PlayerMpconsume: number[][] = [
        [0, 0, 10, 20, 30, 30], [0, 0, 20, 30, 40, 40], [0, 0, 30, 40, 50, 50], [0, 0, 50, 70, 50, 50], [0, 0, 40, 90, 50, 50],
        [0, 0, 55, 120, 50, 50], [0, 0, 55, 150, 50, 50], [0, 0, 100, 125, 50, 50], [0, 0, 130, 150, 50, 50], [0, 0, 150, 170, 200, 50],
        [0, 0, 150, 170, 200, 50], [0, 0, 200, 220, 240, 50], [0, 0, 190, 250, 270, 50], [0, 0, 220, 260, 300, 50], [0, 0, 220, 260, 300, 145],
        [0, 0, 220, 260, 300, 145], [0, 0, 300, 280, 440, 600], [0, 0, 300, 280, 440, 600], [0, 0, 30, 50, 70, 100], [0, 0, 40, 50, 60, 100],
        [0, 0, 40, 50, 60, 100], [0, 0, 280, 330, 190, 100], [0, 0, 280, 330, 190, 100], [0, 0, 280, 330, 190, 100], [0, 0, 280, 330, 190, 100],
        [0, 0, 280, 330, 190, 100], [0, 0, 300, 280, 270, 100], [0, 0, 300, 280, 270, 100], [0, 0, 300, 280, 270, 100], [0, 0, 300, 280, 270, 100],
        [0, 0, 330, 300, 300, 300], [0, 0, 330, 300, 300, 300], [0, 0, 330, 300, 300, 300], [0, 0, 330, 300, 300, 300], [0, 0, 330, 300, 300, 300],]
    //获取玩家数据
    public static GetPlayerDate(id: number, Level: number): number[] {
        let Date: number[] = [0, 0, 0, 0, 0];
        Date[0] = MTRNX_Constant.PlayerAttack[id];
        Date[1] = MTRNX_Constant.PlayerHp[id];
        Date[2] = MTRNX_Constant.PlayerMp[id];
        Date[3] = MTRNX_Constant.PlayerHprecover[id];
        Date[4] = MTRNX_Constant.PlayerMprecover[id];
        for (let i = 2; i <= Level; i++) {
            for (let j = 0; j < Date.length; j++) {
                Date[j] = (Date[j] * 1.1);
            }
        }
        for (let j = 0; j < Date.length; j++) {
            Date[j] = Number(Date[j].toFixed(0));
        }
        return Date;
    }
    //获取升级价格
    public static GetPlayerPrice(id: number, Level: number): number {
        let price = MTRNX_Constant.PlayerUpPrice[id];
        for (let i = 2; i <= Level; i++) {
            price = price * 1.1;
        }
        price = Number(price.toFixed(0));
        return price;
    }
    //获取升级描述文本
    public static GetPlayerUpText(id: number, Level: number): string {
        let data: number[] = MTRNX_Constant.GetPlayerDate(id, Level);
        let data2: number[] = MTRNX_Constant.GetPlayerDate(id, Level + 1);
        let text: string = `等级:${Level}->${Level + 1}\n攻击:${data[0]}->${data2[0]}\n生命:${data[1]}->${data2[1]}\n能量:${data[2]}->${data2[2]}\n生命恢复:${data[3]}->${data2[3]}\n能量恢复:${data[4]}->${data2[4]}`
        return text;
    }

    //关卡配置 左侧 和 右侧
    static SceneJKData: number[][][] = [
        [[], []],
        [[1, 2], []],//第1关
        [[1, 2, 3], [7]],//第2关
        [[1, 2, 3], [7, 19]],//第3关
        [[1, 2, 9, 10, 11], [15]],//第4关
        [[1, 2, 9, 10, 4, 11], [15]],//第5关
        [[2, 10, 3], [22]],//第6关
        [[1, 2, 9, 17, 18], [20, 19]],//第7关
        [[1, 2, 10, 11, 17, 18], [21, 23]],//第8关
        [[2, 10, 3], [21, 23, 8]],//第9关
        [[1, 2, 10, 11], [23, 8]],//第10关
        [[1, 2, 10, 4], [24, 8]],//第11关
        [[2, 10, 4], [23, 8]],//第12关
        [[1, 9, 2, 10, 11, 12], [8, 16]],//第13关
        [[1, 9, 2, 4, 10], [24, 14, 13]],//第14关
        [[3, 9, 4, 10], [8, 16]],//第15关
    ];

    //敌人关卡配置 左侧 和 右侧
    static SceneMTData: number[][][] = [
        [[1], [1]],
        [[1], [1]],//第1关
        [[1, 2, 3], [4]],//第2关
        [[1, 3, 6], [7]],//第3关
        [[2, 4, 6], [12]],//第4关
        [[1, 2, 4, 5, 6], [15]],//第5关
        [[2, 5, 6], [7]],//第6关
        [[1, 2, 3, 4, 6], [11, 8]],//第7关
        [[2, 3, 4, 6, 12, 15], [9]],//第8关
        [[2, 3, 5, 6, 12], [10, 16]],//第9关
        [[1, 2, 6, 7], [14, 19]],//第10关
        [[4, 14, 6], [16, 21]],//第11关
        [[2, 3, 4, 5, 18], [16, 17]],//第12关
        [[2, 4, 5, 6, 7, 18], [9, 21]],//第13关
        [[1, 9, 2, 4, 18], [17, 20]],//第14关
        [[1, 2, 3, 4, 5, 6, 18, 21], [13]],//第15关
    ];

    //无尽模式关卡配置 左侧 和 右侧
    static SceneEndlessJKData: number[][][] = [
        [[], []],
        [[1, 2, 3], [22, 7, 8]],//第1关
        [[1, 2, 3, 9, 10, 11], [14, 15, 16]],//第2关
        [[1, 2, 9, 10, 17, 18], [19, 20, 21]],//第3关
    ];
    //小游戏模式关卡配置
    static MiniSceneJKData: number[][][] = [
        [[1, 2, 3, 4], [7]],//背后能源模式

    ];

    //选关数据
    static LvDatas = [
        { Lv: 1, Title: "初发突袭", Desc: "AI山海经与敌人最初的战斗，一切的开始，在这里会教会你一些基础操作" },
        { Lv: 2, Title: "正式开战", Desc: "AI山海经与敌人的战斗变得愈发焦灼，双方的科技树都突飞猛进，AI山海经方派出了木棍人，而敌方也有个大杀器" },
        { Lv: 3, Title: "战局逆转", Desc: "AI山海经正式讨伐木棍人，敌方也全力阻击，最终的胜利会是AI山海经的吗?" },
        { Lv: 4, Title: "盟友相援", Desc: "星球牛被香蕉猴子使用阴谋诡计击溃，AI山海经陷入低谷，就在此时，AI山海经的盟友终于到来" },
        { Lv: 5, Title: "完全劣势", Desc: "卡布奇诺研究出了黄金木棍人，被寄生的AI山海经都变成了敌方的势力，这样下去，AI山海经迟早会输" },
        { Lv: 6, Title: "暗待良机", Desc: "AI山海经研究出了反寄生枪和仙人掌大象，木棍人能成功得救吗？这可不好预测" },
        { Lv: 7, Title: "暗影迷光", Desc: "AI山海经的营救计划失败，再次陷入劣势，这时神秘的国外AI山海经前来援助" },
        { Lv: 8, Title: "双王之战", Desc: "AI山海经与敌人相见大战一触即发但似乎木棍人也策划了一起阴谋" },
        { Lv: 9, Title: "陨落泰坦", Desc: "AI山海经被引到废墟，却发现是个陷阱，木棍人和其他敌人早已埋伏此处，AI山海经的危机来临了" },
        { Lv: 10, Title: "王者归来", Desc: "AI山海经的基地被敌人发现，空前大战打响，尘封已久的奈氪鲨也终于出动，敌人的末日到了" },
        { Lv: 11, Title: "反击之日", Desc: "AI山海经消灭了敌方大军，局势逆转，敌人军队向着废墟进发，超级木棍人似乎也出动了" },
        { Lv: 12, Title: "逆局之战", Desc: "一方是各项均衡的战士，一方则是灵活敏捷的刺客，逆转战局之战，终将打响" },
        { Lv: 13, Title: "双王集结", Desc: "木棍人终于被救回，双王集结山海经联盟也出动了，一切向好的方向发展，另一边，敌方内部似乎发生了一些问题" },
        { Lv: 14, Title: "决战前夕", Desc: "超级木棍人出动了，敌人进入防守时刻，大战即将到来，AI山海经军队步入敌人基地，追击仙人掌大象" },
        { Lv: 15, Title: "陨落陷阱", Desc: "AI山海经与敌人的决战一触即发，与仙人掌大象展开大战，可他们并不知道，这是一个陷阱" },
    ];

    //无尽模式选关数据
    static EndlessLvDatas = [
        { Lv: 1, Title: "无尽模式一", Desc: "通过故事模式第三关解锁，里面会有无尽模式教程" },
        { Lv: 2, Title: "无尽模式二", Desc: "通过故事模式第六关解锁" },
        { Lv: 3, Title: "无尽模式三", Desc: "通过故事模式第九关解锁" },
    ];

    //关卡对话
    static Dialog = [
        {
            Lv: 1, HaveDialog: true, Speaker: "普通监控人", Desc: [
                "穷凶极恶的AI山海经怪物即将来袭，我来教你一些基础操作",
                "滑动屏幕移动视角",
                "AI山海经怪物来了，试着点击左上角，派出我方单位",
                "右下角是你的能量，我方单位需要能量才能派出，能量可以自动增长，你可以点击升级，它可以让你的能量增长变快"
            ],
        },
        { Lv: 2, HaveDialog: true, Speaker: "普通监控人", Desc: ["嘿，看右侧，那是精英单位，往往有逆转战局的能力，但只能使用一次"] },
        { Lv: 3, HaveDialog: false, Speaker: "普通监控人", Desc: [] },
        { Lv: 4, HaveDialog: true, Speaker: "普通音响人", Desc: ["这个单位有操纵可以穿透敌人的声波的能力，但防御力较低，好好运用可以掌控大局"] },
        { Lv: 5, HaveDialog: true, Speaker: "普通监控人", Desc: ["AI山海经怪物居然寄生了我们的同伴，可是我们却束手无策，幸好我们还有这张王牌"] },
        { Lv: 6, HaveDialog: true, Speaker: "普通监控人", Desc: ["我们研究出了新武器，好好运用它来对付AI山海经怪物"] },
        {
            Lv: 7, HaveDialog: true, Speaker: "普通监控人", Desc: [
                "我方建筑被摧毁了，但是我们有其他人援助",
                "他们可以控制敌人移动，好好运用"],
        },
        { Lv: 8, HaveDialog: false, Speaker: "", Desc: [] },
        { Lv: 9, HaveDialog: false, Speaker: "", Desc: [] },
        { Lv: 10, HaveDialog: true, Speaker: "无双战神", Desc: ["它们已经攻到我们总部，看来要决一死战了"] },
        { Lv: 11, HaveDialog: true, Speaker: "泰坦监控人2", Desc: ["全面反击！进攻！"] },
        { Lv: 12, HaveDialog: true, Speaker: "无双战神", Desc: ["这是最后一次机会了，联盟坚不可摧，AI山海经，进攻！"] },
        { Lv: 13, HaveDialog: true, Speaker: "双王", Desc: ["决战无法避免，AI山海经，出击！"] },
        { Lv: 14, HaveDialog: true, Speaker: "刺客音响人", Desc: ["敌人进行了反攻！防守！"] },
        { Lv: 15, HaveDialog: false, Speaker: "", Desc: [] },
    ];


    //关卡对话
    static EndlessDialog = [
        {
            Lv: 1, HaveDialog: true, Speaker: "普通监控人", Desc: [
                "如果你是第一次玩无尽模式，那一定要看这些规则",
                "山海经怪物会源源不断的出现，如果你死了那就不能复活了",
                "击败山海经怪物或者让我方到达最右侧，都会获得分数，分数越高说明你表现的越好",
                "每隔120秒就会有补给送来，好好运用它",
                "你掉血时会增加能量",
                "敌人会越来越强，所以说你会越来越难生存",
                //"困难模式分数翻1.5倍",
            ],
        },
        { Lv: 2, HaveDialog: false, Speaker: "普通监控人", Desc: [] },
        { Lv: 3, HaveDialog: false, Speaker: "普通监控人", Desc: [] },
    ];

    static WarningBeginSize = [300, 300, 150];
    static WarningBegin = [
        "准备",
        "抵抗",
        "山海经大军",
    ];

    static WarningFailSize = [300, 150, 150, 100];
    static WarningFail = [
        "你",
        "没有抵御住",
        "山海经大军的进攻",
        "点击任意处返回",
    ];

    static WarningWinSize = [300, 150, 150, 100];
    static WarningWin = [
        "你",
        "抵御住了",
        "山海经大军的进攻",
        "点击任意处返回",
    ];

    static Tip = {
        KeyLow: "钥匙数量不足，可以通过前面一关来解锁此关卡，或者通过宝箱获取钥匙。",
        MiNiKeyLow: "钥匙数量不足，可以通关条件解锁关卡，或者通过宝箱获取钥匙。",
        EndlessKeyLow: "钥匙数量不足，可以通过宝箱获取钥匙。",
    };

    static Key = {
        AgreePolicy: "AgreePolicy",
        Lv: "Lv",
        EndlessLv: "EndlessLv",
        Key: "Key",
    }



}

//监控人种类
export enum MTRNX_JKType {
    None = 0,
    监控人 = 1,
    中型监控人 = 2,
    蜘蛛监控 = 3,
    激光监控人 = 4,
    泰坦监控人 = 7,
    泰坦监控人2 = 8,
    音响人 = 9,
    中型音响人 = 10,
    蜘蛛音响 = 11,
    飞行音响 = 12,
    刺客音响人 = 13,
    女音响人 = 14,
    泰坦音响人 = 15,
    泰坦音响人2 = 16,
    电视人 = 17,
    中型电视人 = 18,
    女电视人 = 19,
    泰坦电视人 = 20,
    泰坦电视人2 = 21,
    反寄生战车 = 22,
    无双战神 = 23,
    无双战神2 = 24,
}

//马桶人种类
export enum MTRNX_MTType {
    None = 0,
    桨叶马桶 = 1,
    灰马桶 = 2,
    黑马桶 = 3,
    人形哥 = 4,
    三头马桶 = 5,
    马桶炮台 = 6,
    蜘蛛激光 = 7,
    焚化炉蹲便器 = 8,
    Gman = 9,
    酸液马桶 = 10,
    飞天大圆锯 = 11,


    蒙面马桶 = 12,
    马桶博士 = 13,
    人性冲锋哥 = 14,
    迷彩马桶 = 15,
    剑刃蜘蛛马桶 = 16,
    天使马桶 = 17,
    灰色装甲马桶 = 18,
    栽绒帽灰马桶 = 19,
    飞天冲撞黑马桶 = 20,
    黑色火箭自爆马桶 = 21,
}


export enum MTRNX_RewardType {
    能量250 = "250能量",
    增加最大生命值 = "增加最大生命值",
    降低马桶人生成速度 = "降低马桶人生成速度",
    立即获得800分数 = "立即获得800分数",
}

export enum MTRNX_HEX {
    白色 = "#FFFFFF",
    红色 = "#FF0000",
    电视人受击激光 = "#AD6FF1",
    女电视人受击激光 = "#BE5B00",
}

export enum MTRNX_GameMode {
    Normal,//故事模式
    Endless,//无尽模式
    Massacre,//杀戮模式
    Sandbox,//沙盒模式
    背后能源,
}