
export enum TKJWL_TaskType {
        往锅里装水 = "去厨房往锅里装水",
        等待水装好 = "等待水装好",
        将锅放到煤气灶上 = "将锅放到煤气灶上",
        打开煤气灶烧水 = "转动旋钮，开始烧水",
        把垃圾扔进垃圾桶 = "收拾沙发旁的垃圾，把垃圾扔进垃圾桶(${}/2)",
        去楼道的垃圾管道扔掉垃圾袋 = "将蓝色垃圾袋，拿去楼道拐角的垃圾回收处扔掉(${}/2)",
        将水饺放到锅里 = "将冰箱里的水饺放到锅里",
        等待水饺煮好 = "等待水饺煮好",
        将煮好的的水饺放到餐桌上 = "将煮好的的水饺放到餐桌上",
        坐到餐桌前 = "坐到餐桌前",
        坐到餐桌前吃掉水饺 = "坐到餐桌前吃掉水饺",
        在阳台用望远镜查看情况 = "在阳台用望远镜查看情况",
        他正在向你奔来 = "他正在向你奔来，你需要存活下来",
        躲起来 = "躲起来",
        找准时机逃跑 = "找准时机逃跑",
        快跑 = "快跑",
        警察来了 = "警察来了，你安全了",
}


